/*
	算术运算符+的用法
		1.进行数学中的加法运算
		2.进行字符串的连接操作(把两个字符串拼接到一起)
*/
public class Demo13Operator {
	public static void main(String[] args){
		//进行数学中的加法运算
		System.out.println(5 + 5);//10
		//char + int ==> int + int ==> 97 + 5 ==> 102
		System.out.println('a' + 5);//102
		
		//byte/short/char 只要参加运算,都会自动类型转换为int类型
		//char + char ==> int + int ==> 97 + 98 ==> 195
		System.out.println('a' + 'b');//195
		
		System.out.println("HelloWorld");
		//+的前面是字符串,+的后面也是字符串,此处+代表的是字符串的连接操作
		System.out.println("Hello"+"World");
		/*
			表达式"5+5="+5+5: 从左向右计算的
			先计算"5+5="+5: 此处+号前面是字符串"5+5=",+号后面是数字5,此处+号代表字符串的连接操作
			"5+5="+5的结果: "5+5=5"
			再计算"5+5=5"+5: 此处+号前面是字符串"5+5=5",+号后面是数字5,此处+号代表字符串的连接操作
			"5+5=5"+5的结果: "5+5=55"
		*/
		System.out.println("5+5="+5+5);//5+5=55
		/*
			表达式"5+5="+(5+5): 从左向右计算的,但是由于表达式中有(),优先计算()中的内容
			先加算5+5: 此处+号前面是数字5,+号后面是数字5,此处+号代表数学中的加法运算
			5+5的结果: 10
			再计算"5+5="+10:此处+号前面是字符串"5+5=",+号后面是数字5,此处+号代表字符串的连接操作
			"5+5="+10的结果:"5+5=10"
		*/
		System.out.println("5+5="+(5+5));//5+5=10
	}
}