//自动类型转换练习一
public class Demo06Convert {
	public static void main(String[] args){
		int i = 1; 
		byte b = 2; 
		/*	
			错误: 
			b是byte类型(占1个字节),i是int类型(占4个字节),类型不一致,会发生自动类型转换
			把byte类型的b(占1个字节),自动类型转换为int类型(占4个字节),左侧补充3个字节的0,数字大小仍然是2
			byte类型的b: 00000010
			自动类型转换为int类型: 00000000 00000000 00000000 00000010
			byte + int ==> int + int ==> int 结果是int类型(占4个字节),
			不能直接赋值给左侧的byte类型变量x(占1个字节)
			
			大萝卜不能直接放入小坑中
			解决方案:
				1.把坑变大(目前采用这种方式)
				2.把萝卜变小(后面采用这种方式: 强制类型转换)
		*/
		//byte x = b + i;	
		
		/*	
			正确: 
			b是byte类型(占1个字节),i是int类型(占4个字节),类型不一致,会发生自动类型转换
			把byte类型的b(占1个字节),自动类型转换为int类型(占4个字节),左侧补充3个字节的0,数字大小仍然是2
			byte类型的b: 00000010
			自动类型转换为int类型: 00000000 00000000 00000000 00000010
			byte + int ==> int + int ==> int 结果是int类型(占4个字节),
			可以直接赋值给左侧的int类型变量x(占4个字节)
		*/
		int x = b + i;
		System.out.println(x);
	}
}